package codes;

public class Codes {
	public static void main(String[] args) {
	//  알고리즘 코드 모음표!!  //	
		
// 순위구하기
// 자기 자신부터 비교를 시작(그러니 5번)
		
//			for(int i=1; i<=s.length; i++) {
//				for(int j=i+1; j<=s.length; j++) {
//					if(s[i-1] < s[j-1]) rank[i-1]++;   
//					else if (s[i-1] > s[j-1]) rank[j-1]++; 
//				}
//			}
// =============================================================================================================
// 순위순 오름차순 정렬처리
		
//		for(int i=1; i<=s.length-1; i++) {
//			for(int j=i+1; j<=no.length; j++) {
//				if(rank[i-1] > rank[j-1]) {
//					temp = rank[i-1];  rank[i-1] = rank[j-1];  rank[j-1] = temp;
//					temp = no[i-1];  no[i-1] = no[j-1];  no[j-1] = temp;
//					temp = s[i-1];  s[i-1] = s[j-1];  s[j-1] = temp;
//				}
//			}		
//		}		
//		
// =============================================================================================================
		
		
		
// =============================================================================================================		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
	}
}
